# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [40]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [41]:
data1 = np.random.randint(1,5,100)
series1 = pd.Series(data1)

data2 = np.random.randint(1,4,100)
series2 = pd.Series(data2)

data3 = np.random.randint(10000,30001,100)
series3 = pd.Series(data3)

### Step 3. Let's create a DataFrame by joinning the Series by column

In [42]:
df = pd.concat([series1, series2, series3], axis=1)
df.head(10)

   0  1      2
0  3  3  27393
1  3  2  23238
2  2  3  28672
3  1  2  15316
4  3  3  17080
5  1  2  12679
6  3  1  15697
7  2  3  14129
8  2  1  22673
9  2  3  24824

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [43]:
df.rename(columns = {0: 'bedrs', 1: 'bathrs', 2: 'price_sqr_meter'}, inplace=True)
df.head()

   bedrs  bathrs  price_sqr_meter
0      3       3            27393
1      3       2            23238
2      2       3            28672
3      1       2            15316
4      3       3            17080

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [44]:
bigcolumn = pd.concat([series1, series2, series3], axis=0)
bigcolumn

0         3
1         3
2         2
3         1
4         3
      ...
95    18194
96    20637
97    13765
98    15709
99    14489
Length: 300, dtype: int64

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [45]:
bigcolumn.info()

<class 'pandas.core.series.Series'>
Int64Index: 300 entries, 0 to 99
Series name: None
Non-Null Count  Dtype
--------------  -----
300 non-null    int64
dtypes: int64(1)
memory usage: 4.7 KB

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [51]:
bigcolumn.reset_index(drop=True, inplace=True)
bigcolumn.info()

<class 'pandas.core.series.Series'>
RangeIndex: 300 entries, 0 to 299
Series name: None
Non-Null Count  Dtype
--------------  -----
300 non-null    int64
dtypes: int64(1)
memory usage: 2.5 KB